fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Gpio.h
//
//      TMDX ALPHA RELEASE
//      Intended for product evaluation purposes
//
//###########################################################################
//
// FILE:	DSP28_Gpio.h
//
// TITLE:	DSP28 General Purpose I/O Definitions.
//
//###########################################################################
//
//  Ver | dd mmm yyyy | Who  | Description of changes
// =====|=============|======|===============================================
//  0.55| 06 May 2002 | L.H. | EzDSP Alpha Release
//  0.56| 20 May 2002 | L.H. | No change
//  0.57| 24 May 2002 | L.H. | Fixed typo's on GPIOG registers
//###########################################################################

#ifndef DSP28_GPIO_H
#define DSP28_GPIO_H

#include "F2812_datatype.h"

//----------------------------------------------------
// General purpose I/O (GPIO) Register Bit Definitions

//----------------------------------------------------
// GPIO A mux control register bit definitions */
//
//
struct GPAMUX_BITS         // bits   description
{
    UINT16 PWM1_GPIOA0: 1;    // 0
    UINT16 PWM2_GPIOA1: 1;    // 1
    UINT16 PWM3_GPIOA2: 1;    // 2
    UINT16 PWM4_GPIOA3: 1;    // 3
    UINT16 PWM5_GPIOA4: 1;    // 4
    UINT16 PWM6_GPIOA5: 1;    // 5
    UINT16 T1PWM_GPIOA6: 1;   // 6
    UINT16 T2PWM_GPIOA7: 1;   // 7
    UINT16 CAP1Q1_GPIOA8: 1;  // 8
    UINT16 CAP2Q2_GPIOA9: 1;  // 9
    UINT16 CAP3QI1_GPIOA10: 1; // 10
    UINT16 TDIRA_GPIOA11: 1;  // 11
    UINT16 TCLKINA_GPIOA12: 1; // 12
    UINT16 C1TRIP_GPIOA13: 1; // 13
    UINT16 C2TRIP_GPIOA14: 1; // 14
    UINT16 C3TRIP_GPIOA15: 1; // 15

};

union GPAMUX_REG
{
    UINT16        all;
    struct GPAMUX_BITS bit;
};



//---------------------------------------------------------------------------------------
// GPIO A Direction control register bit definitions
//
//
struct GPADIR_BITS         // bits   description
{
    UINT16 GPIOA0: 1;         // 0
    UINT16 GPIOA1: 1;         // 1
    UINT16 GPIOA2: 1;         // 2
    UINT16 GPIOA3: 1;         // 3
    UINT16 GPIOA4: 1;         // 4
    UINT16 GPIOA5: 1;         // 5
    UINT16 GPIOA6: 1;         // 6
    UINT16 GPIOA7: 1;         // 7
    UINT16 GPIOA8: 1;         // 8
    UINT16 GPIOA9: 1;         // 9
    UINT16 GPIOA10: 1;        // 10
    UINT16 GPIOA11: 1;        // 11
    UINT16 GPIOA12: 1;        // 12
    UINT16 GPIOA13: 1;        // 13
    UINT16 GPIOA14: 1;        // 14
    UINT16 GPIOA15: 1;        // 15

};

union GPADIR_REG
{
    UINT16               all;
    struct GPADIR_BITS bit;
};

//----------------------------------
// GPA Qualregister bit definitions
//
//

struct GPAQUAL_BITS        // bits   description
{
    UINT16     QUALPRD: 8;    // 0:7    Qualification Sampling Period
    UINT16 rsvd1: 8;          // 15:8   reserved
};

union GPAQUAL_REG
{
    UINT16              all;
    struct GPAQUAL_BITS BIT;
};


//---------------------------------------------------------------------------------------
// GPIO A Data register bit definitions
//
//
struct GPADAT_BITS         // bits   description
{
    UINT16 GPIOA0: 1;         // 0
    UINT16 GPIOA1: 1;         // 1
    UINT16 GPIOA2: 1;         // 2
    UINT16 GPIOA3: 1;         // 3
    UINT16 GPIOA4: 1;         // 4
    UINT16 GPIOA5: 1;         // 5
    UINT16 GPIOA6: 1;         // 6
    UINT16 GPIOA7: 1;         // 7
    UINT16 GPIOA8: 1;         // 8
    UINT16 GPIOA9: 1;         // 9
    UINT16 GPIOA10: 1;        // 10
    UINT16 GPIOA11: 1;        // 11
    UINT16 GPIOA12: 1;        // 12
    UINT16 GPIOA13: 1;        // 13
    UINT16 GPIOA14: 1;        // 14
    UINT16 GPIOA15: 1;        // 15

};

union GPADAT_REG
{
    UINT16        all;
    struct GPADAT_BITS bit;
};


//---------------------------------------------------------------------------------------
// GPIO A Data set bit definitions
//
//
struct GPASET_BITS         // bits   description
{
    UINT16 GPIOA0: 1;         // 0
    UINT16 GPIOA1: 1;         // 1
    UINT16 GPIOA2: 1;         // 2
    UINT16 GPIOA3: 1;         // 3
    UINT16 GPIOA4: 1;         // 4
    UINT16 GPIOA5: 1;         // 5
    UINT16 GPIOA6: 1;         // 6
    UINT16 GPIOA7: 1;         // 7
    UINT16 GPIOA8: 1;         // 8
    UINT16 GPIOA9: 1;         // 9
    UINT16 GPIOA10: 1;        // 10
    UINT16 GPIOA11: 1;        // 11
    UINT16 GPIOA12: 1;        // 12
    UINT16 GPIOA13: 1;        // 13
    UINT16 GPIOA14: 1;        // 14
    UINT16 GPIOA15: 1;        // 15

};

union GPASET_REG
{
    UINT16        all;
    struct GPASET_BITS bit;
};



//---------------------------------------------------------------------------------------
// GPIO A Data clear register bit definitions
//
//
struct GPACLEAR_BITS       // bits   description
{
    UINT16 GPIOA0: 1;         // 0
    UINT16 GPIOA1: 1;         // 1
    UINT16 GPIOA2: 1;         // 2
    UINT16 GPIOA3: 1;         // 3
    UINT16 GPIOA4: 1;         // 4
    UINT16 GPIOA5: 1;         // 5
    UINT16 GPIOA6: 1;         // 6
    UINT16 GPIOA7: 1;         // 7
    UINT16 GPIOA8: 1;         // 8
    UINT16 GPIOA9: 1;         // 9
    UINT16 GPIOA10: 1;        // 10
    UINT16 GPIOA11: 1;        // 11
    UINT16 GPIOA12: 1;        // 12
    UINT16 GPIOA13: 1;        // 13
    UINT16 GPIOA14: 1;        // 14
    UINT16 GPIOA15: 1;        // 15

};

union GPACLEAR_REG
{
    UINT16        all;
    struct GPACLEAR_BITS bit;
};

//---------------------------------------------------------------------------------------
// GPIO A Data toggle register bit definitions
//
//
struct GPATOGGLE_BITS      // bits   description
{
    UINT16 GPIOA0: 1;         // 0
    UINT16 GPIOA1: 1;         // 1
    UINT16 GPIOA2: 1;         // 2
    UINT16 GPIOA3: 1;         // 3
    UINT16 GPIOA4: 1;         // 4
    UINT16 GPIOA5: 1;         // 5
    UINT16 GPIOA6: 1;         // 6
    UINT16 GPIOA7: 1;         // 7
    UINT16 GPIOA8: 1;         // 8
    UINT16 GPIOA9: 1;         // 9
    UINT16 GPIOA10: 1;        // 10
    UINT16 GPIOA11: 1;        // 11
    UINT16 GPIOA12: 1;        // 12
    UINT16 GPIOA13: 1;        // 13
    UINT16 GPIOA14: 1;        // 14
    UINT16 GPIOA15: 1;        // 15

