fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Gpio.h
};

union GPATOGGLE_REG
{
    UINT16        all;
    struct GPATOGGLE_BITS bit;
};



//---------------------------------------------------------------------------------
// GPIO B mux control register bit definitions
//
//
struct GPBMUX_BITS         // bits   description
{
    UINT16 PWM7_GPIOB0: 1;    // 0
    UINT16 PWM8_GPIOB1: 1;    // 1
    UINT16 PWM9_GPIOB2: 1;    // 2
    UINT16 PWM10_GPIOB3: 1;   // 3
    UINT16 PWM11_GPIOB4: 1;   // 4
    UINT16 PWM12_GPIOB5: 1;   // 5
    UINT16 T3PWM_GPIOB6: 1;   // 6
    UINT16 T4PWM_GPIOB7: 1;   // 7
    UINT16 CAP4Q1_GPIOB8: 1;  // 8
    UINT16 CAP5Q2_GPIOB9: 1;  // 9
    UINT16 CAP6QI2_GPIOB10: 1; // 10
    UINT16 TDIRB_GPIOB11: 1;  // 11
    UINT16 TCLKINB_GPIOB12: 1; // 12
    UINT16 C4TRIP_GPIOB13: 1; // 13
    UINT16 C5TRIP_GPIOB14: 1; // 14
    UINT16 C6TRIP_GPIOB15: 1; // 15

};

union GPBMUX_REG
{
    UINT16        all;
    struct GPBMUX_BITS bit;
};

//---------------------------------------------------------------------------------------
// GPIO B Direction control register bit definitions
//
//
struct GPBDIR_BITS         // bits  description
{
    UINT16 GPIOB0: 1;         // 0
    UINT16 GPIOB1: 1;         // 1
    UINT16 GPIOB2: 1;         // 2
    UINT16 GPIOB3: 1;         // 3
    UINT16 GPIOB4: 1;         // 4
    UINT16 GPIOB5: 1;         // 5
    UINT16 GPIOB6: 1;         // 6
    UINT16 GPIOB7: 1;         // 7
    UINT16 GPIOB8: 1;         // 8
    UINT16 GPIOB9: 1;         // 9
    UINT16 GPIOB10: 1;        // 10
    UINT16 GPIOB11: 1;        // 11
    UINT16 GPIOB12: 1;        // 12
    UINT16 GPIOB13: 1;        // 13
    UINT16 GPIOB14: 1;        // 14
    UINT16 GPIOB15: 1;        // 15

};

union GPBDIR_REG
{
    UINT16        all;
    struct GPBDIR_BITS bit;
};

//-----------------------------------
// GPB Qualregister bit definitions
//
//

struct GPBQUAL_BITS        // bits   description
{
    UINT16     QUALPRD: 8;    // 0:7    Qualification Sampling Period
    UINT16 rsvd1: 8;          // 15:8   reserved
};

union GPBQUAL_REG
{
    UINT16              all;
    struct GPBQUAL_BITS BIT;
};


//---------------------------------------------------------------------------------------
// GPIO B data register bit definitions
//
//
struct GPBDAT_BITS         // bits  description
{
    UINT16 GPIOB0: 1;         // 0
    UINT16 GPIOB1: 1;         // 1
    UINT16 GPIOB2: 1;         // 2
    UINT16 GPIOB3: 1;         // 3
    UINT16 GPIOB4: 1;         // 4
    UINT16 GPIOB5: 1;         // 5
    UINT16 GPIOB6: 1;         // 6
    UINT16 GPIOB7: 1;         // 7
    UINT16 GPIOB8: 1;         // 8
    UINT16 GPIOB9: 1;         // 9
    UINT16 GPIOB10: 1;        // 10
    UINT16 GPIOB11: 1;        // 11
    UINT16 GPIOB12: 1;        // 12
    UINT16 GPIOB13: 1;        // 13
    UINT16 GPIOB14: 1;        // 14
    UINT16 GPIOB15: 1;        // 15

};

union GPBDAT_REG
{
    UINT16        all;
    struct GPBDAT_BITS bit;
};



//---------------------------------------------------------------------------------------
// GPIO B data set register bit definitions
//
//
struct GPBSET_BITS         // bits  description
{
    UINT16 GPIOB0: 1;         // 0
    UINT16 GPIOB1: 1;         // 1
    UINT16 GPIOB2: 1;         // 2
    UINT16 GPIOB3: 1;         // 3
    UINT16 GPIOB4: 1;         // 4
    UINT16 GPIOB5: 1;         // 5
    UINT16 GPIOB6: 1;         // 6
    UINT16 GPIOB7: 1;         // 7
    UINT16 GPIOB8: 1;         // 8
    UINT16 GPIOB9: 1;         // 9
    UINT16 GPIOB10: 1;        // 10
    UINT16 GPIOB11: 1;        // 11
    UINT16 GPIOB12: 1;        // 12
    UINT16 GPIOB13: 1;        // 13
    UINT16 GPIOB14: 1;        // 14
    UINT16 GPIOB15: 1;        // 15

};


union GPBSET_REG
{
    UINT16        all;
    struct GPBSET_BITS bit;
};


//---------------------------------------------------------------------------------------
// GPIO B data clear register bit definitions
//
//
struct GPBCLEAR_BITS         // bits  description
{
    UINT16 GPIOB0: 1;         // 0
    UINT16 GPIOB1: 1;         // 1
    UINT16 GPIOB2: 1;         // 2
    UINT16 GPIOB3: 1;         // 3
    UINT16 GPIOB4: 1;         // 4
    UINT16 GPIOB5: 1;         // 5
    UINT16 GPIOB6: 1;         // 6
    UINT16 GPIOB7: 1;         // 7
    UINT16 GPIOB8: 1;         // 8
    UINT16 GPIOB9: 1;         // 9
    UINT16 GPIOB10: 1;        // 10
    UINT16 GPIOB11: 1;        // 11
    UINT16 GPIOB12: 1;        // 12
    UINT16 GPIOB13: 1;        // 13
    UINT16 GPIOB14: 1;        // 14
    UINT16 GPIOB15: 1;        // 15

};

union GPBCLEAR_REG
{
    UINT16        all;
    struct GPBCLEAR_BITS bit;
};



//---------------------------------------------------------------------------------------
// GPIO B data toggle register bit definitions
//
//
struct GPBTOGGLE_BITS      // bits  description
{
    UINT16 GPIOB0: 1;         // 0
    UINT16 GPIOB1: 1;         // 1
    UINT16 GPIOB2: 1;         // 2
    UINT16 GPIOB3: 1;         // 3
    UINT16 GPIOB4: 1;         // 4
    UINT16 GPIOB5: 1;         // 5
    UINT16 GPIOB6: 1;         // 6
    UINT16 GPIOB7: 1;         // 7
    UINT16 GPIOB8: 1;         // 8
    UINT16 GPIOB9: 1;         // 9
    UINT16 GPIOB10: 1;        // 10
    UINT16 GPIOB11: 1;        // 11
    UINT16 GPIOB12: 1;        // 12
    UINT16 GPIOB13: 1;        // 13
    UINT16 GPIOB14: 1;        // 14
    UINT16 GPIOB15: 1;        // 15

};

union GPBTOGGLE_REG
{
    UINT16        all;
    struct GPBTOGGLE_BITS bit;
};


//---------------------------------------------------------------------------------
// GPIO D mux control register bit definitions
//
//
struct GPDMUX_BITS                   // bits  description
{
    UINT16 T1CTRIP_PDPA_GPIOD0: 1;      // 0
    UINT16 T2CTRIP_SOCA_GPIOD1: 1;      // 1
    UINT16 rsvd1: 3;        			 // 4:2
    UINT16 T3CTRIP_PDPB_GPIOD5: 1;      // 5
    UINT16 T4CTRIP_SOCB_GPIOD6: 1;      // 6
    UINT16 rsvd2: 9;        			 // 15:7

};

union GPDMUX_REG
{
    UINT16        all;
    struct GPDMUX_BITS bit;
};

//----------------------------------------------------
// GPIO D Direction control register bit definitions
//
//
struct GPDDIR_BITS         // bits   description
{
    UINT16 GPIOD0: 1;         // 0
    UINT16 GPIOD1: 1;         // 1
    UINT16 rsvd1: 3;          // 4:2
    UINT16 GPIOD5: 1;         // 5
    UINT16 GPIOD6: 1;         // 6
    UINT16 rsvd2: 9;          // 15:7
};

union GPDDIR_REG
{
    UINT16        all;
    struct GPDDIR_BITS bit;
};


//----------------------------------------------------
// GPIO D data register bit definitions
//
//
struct GPDDAT_BITS         // bits   description
{
    UINT16 GPIOD0: 1;         // 0
    UINT16 GPIOD1: 1;         // 1
    UINT16 rsvd1: 3;          // 4:2
    UINT16 GPIOD5: 1;         // 5
    UINT16 GPIOD6: 1;         // 6
    UINT16 rsvd2: 9;          // 15:7
};

union GPDDAT_REG
{
    UINT16        all;
    struct GPDDAT_BITS bit;
};


//----------------------------------------------------
// GPIO D data set register bit definitions
//
//
struct GPDSET_BITS         // bits   description
{
    UINT16 GPIOD0: 1;         // 0
    UINT16 GPIOD1: 1;         // 1
    UINT16 rsvd1: 3;          // 4:2
    UINT16 GPIOD5: 1;         // 5
    UINT16 GPIOD6: 1;         // 6
    UINT16 rsvd2: 9;          // 15:7
};

