fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Gpio.h
union GPDSET_REG
{
    UINT16        all;
    struct GPDSET_BITS bit;
};


//----------------------------------------------------
// GPIO D data clear register bit definitions
//
//
struct GPDCLEAR_BITS         // bits   description
{
    UINT16 GPIOD0: 1;         // 0
    UINT16 GPIOD1: 1;         // 1
    UINT16 rsvd1: 3;          // 4:2
    UINT16 GPIOD5: 1;         // 5
    UINT16 GPIOD6: 1;         // 6
    UINT16 rsvd2: 9;          // 15:7
};

union GPDCLEAR_REG
{
    UINT16        all;
    struct GPDCLEAR_BITS bit;
};



//----------------------------------------------------
// GPIO D data toggle register bit definitions
//
//
struct GPDTOGGLE_BITS      // bits   description
{
    UINT16 GPIOD0: 1;         // 0
    UINT16 GPIOD1: 1;         // 1
    UINT16 rsvd1: 3;          // 4:2
    UINT16 GPIOD5: 1;         // 5
    UINT16 GPIOD6: 1;         // 6
    UINT16 rsvd2: 9;          // 15:7
};

union GPDTOGGLE_REG
{
    UINT16        all;
    struct GPDTOGGLE_BITS bit;
};



//----------------------------------
// GPIOD Qualregister bit definitions
//
//
struct GPDQUAL_BITS        // bits   description
{
    UINT16     QUALPRD: 8;    // 0:7    Qualification Sampling Period
    UINT16 rsvd1: 8;          // 15:8   reserved
};

union GPDQUAL_REG
{
    UINT16              all;
    struct GPDQUAL_BITS BIT;
};


//---------------------------------------------
// GPIO E mux control register bit definitions
//
//
struct GPEMUX_BITS                   // bits  description
{
    UINT16 XINT1_XBIO_GPIOE0: 1;        // 0
    UINT16 XINT2_ADCSOC_GPIOE1: 1;      // 1
    UINT16 XNMI_XINT13_GPIOE2: 1;       // 2
    UINT16 rsvd1: 12;        			 // 15:3

};

union GPEMUX_REG
{
    UINT16        all;
    struct GPEMUX_BITS bit;
};

//---------------------------------------------------
// GPIO E Direction control register bit definitions
//
//
struct GPEDIR_BITS         // bits   description
{
    UINT16 GPIOE0: 1;         // 0
    UINT16 GPIOE1: 1;         // 1
    UINT16 GPIOE2: 1;         // 2
    UINT16 rsvd1: 12;         // 15:3
};

union GPEDIR_REG
{
    UINT16        all;
    struct GPEDIR_BITS bit;
};

//---------------------------------------------------
// GPIO E data register bit definitions
//
//
struct GPEDAT_BITS         // bits   description
{
    UINT16 GPIOE0: 1;         // 0
    UINT16 GPIOE1: 1;         // 1
    UINT16 GPIOE2: 1;         // 2
    UINT16 rsvd1: 12;         // 15:3
};

union GPEDAT_REG
{
    UINT16        all;
    struct GPEDAT_BITS bit;
};



//---------------------------------------------------
// GPIO E data set register bit definitions
//
//
struct GPESET_BITS         // bits   description
{
    UINT16 GPIOE0: 1;         // 0
    UINT16 GPIOE1: 1;         // 1
    UINT16 GPIOE2: 1;         // 2
    UINT16 rsvd1: 12;         // 15:3
};

union GPESET_REG
{
    UINT16        all;
    struct GPESET_BITS bit;
};


//---------------------------------------------------
// GPIO E data clear register bit definitions
//
//
struct GPECLEAR_BITS       // bits   description
{
    UINT16 GPIOE0: 1;         // 0
    UINT16 GPIOE1: 1;         // 1
    UINT16 GPIOE2: 1;         // 2
    UINT16 rsvd1: 12;         // 15:3
};

union GPECLEAR_REG
{
    UINT16        all;
    struct GPECLEAR_BITS bit;
};


//---------------------------------------------------
// GPIO E data toggle register bit definitions
//
//
struct GPETOGGLE_BITS      // bits   description
{
    UINT16 GPIOE0: 1;         // 0
    UINT16 GPIOE1: 1;         // 1
    UINT16 GPIOE2: 1;         // 2
    UINT16 rsvd1: 12;         // 15:3
};

union GPETOGGLE_REG
{
    UINT16        all;
    struct GPETOGGLE_BITS bit;
};



//-----------------------------------
// GPIOE Qualregister bit definitions
//
//
struct GPEQUAL_BITS        // bits   description
{
    UINT16     QUALPRD: 8;    // 0:7    Qualification Sampling Period
    UINT16 rsvd1: 8;          // 15:8   reserved
};

union GPEQUAL_REG
{
    UINT16              all;
    struct GPEQUAL_BITS BIT;
};


//----------------------------------------------
//  GPIO F mux control register bit definitions
//
//
struct GPFMUX_BITS         // bits   description
{
    UINT16 SPISIMOA_GPIOF0: 1; // 0
    UINT16 SPISOMIA_GPIOF1: 1; // 1
    UINT16 SPICLKA_GPIOF2: 1; // 2
    UINT16 SPISTEA_GPIOF3: 1; // 3
    UINT16 SCITXDA_GPIOF4: 1; // 4
    UINT16 SCIRXDA_GPIOF5: 1; // 5
    UINT16 CANTXA_GPIOF6: 1;  // 6
    UINT16 CANRXA_GPIOF7: 1;  // 7
    UINT16 MCLKXA_GPIOF8: 1;  // 8
    UINT16 MCLKRA_GPIOF9: 1;  // 9
    UINT16 MFSXA_GPIOF10: 1;  // 10
    UINT16 MFSRA_GPIOF11: 1;  // 11
    UINT16 MDXA_GPIOF12: 1;   // 12
    UINT16 MDRA_GPIOF13: 1;   // 13
    UINT16 XF_GPIOF14: 1;     // 14
    UINT16 spare_GPIOF15: 1;  // 15

};

/* Allow access to the bit fields or entire register */
union GPFMUX_REG
{
    UINT16        all;
    struct GPFMUX_BITS bit;
};

//---------------------------------------------------
// GPIO F Direction control register bit definitions
//
//

struct GPFDIR_BITS         // bits   description
{
    UINT16 GPIOF0: 1;         // 0
    UINT16 GPIOF1: 1;         // 1
    UINT16 GPIOF2: 1;         // 2
    UINT16 GPIOF3: 1;         // 3
    UINT16 GPIOF4: 1;         // 4
    UINT16 GPIOF5: 1;         // 5
    UINT16 GPIOF6: 1;         // 6
    UINT16 GPIOF7: 1;         // 7
    UINT16 GPIOF8: 1;         // 8
    UINT16 GPIOF9: 1;         // 9
    UINT16 GPIOF10: 1;        // 10
    UINT16 GPIOF11: 1;        // 11
    UINT16 GPIOF12: 1;        // 12
    UINT16 GPIOF13: 1;        // 13
    UINT16 GPIOF14: 1;        // 14
    UINT16 GPIOF15: 1;        // 15

};

union GPFDIR_REG
{
    UINT16        all;
    struct GPFDIR_BITS bit;
};

//---------------------------------------------------
// GPIO F data register bit definitions
//
//

struct GPFDAT_BITS         // bits   description
{
    UINT16 GPIOF0: 1;         // 0
    UINT16 GPIOF1: 1;         // 1
    UINT16 GPIOF2: 1;         // 2
    UINT16 GPIOF3: 1;         // 3
    UINT16 GPIOF4: 1;         // 4
    UINT16 GPIOF5: 1;         // 5
    UINT16 GPIOF6: 1;         // 6
    UINT16 GPIOF7: 1;         // 7
    UINT16 GPIOF8: 1;         // 8
    UINT16 GPIOF9: 1;         // 9
    UINT16 GPIOF10: 1;        // 10
    UINT16 GPIOF11: 1;        // 11
    UINT16 GPIOF12: 1;        // 12
    UINT16 GPIOF13: 1;        // 13
    UINT16 GPIOF14: 1;        // 14
    UINT16 GPIOF15: 1;        // 15

