fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Gpio.h
};

union GPFDAT_REG
{
    UINT16        all;
    struct GPFDAT_BITS bit;
};


//---------------------------------------------------
// GPIO F data set register bit definitions
//
//

struct GPFSET_BITS         // bits   description
{
    UINT16 GPIOF0: 1;         // 0
    UINT16 GPIOF1: 1;         // 1
    UINT16 GPIOF2: 1;         // 2
    UINT16 GPIOF3: 1;         // 3
    UINT16 GPIOF4: 1;         // 4
    UINT16 GPIOF5: 1;         // 5
    UINT16 GPIOF6: 1;         // 6
    UINT16 GPIOF7: 1;         // 7
    UINT16 GPIOF8: 1;         // 8
    UINT16 GPIOF9: 1;         // 9
    UINT16 GPIOF10: 1;        // 10
    UINT16 GPIOF11: 1;        // 11
    UINT16 GPIOF12: 1;        // 12
    UINT16 GPIOF13: 1;        // 13
    UINT16 GPIOF14: 1;        // 14
    UINT16 GPIOF15: 1;        // 15

};

union GPFSET_REG
{
    UINT16        all;
    struct GPFSET_BITS bit;
};


//---------------------------------------------------
// GPIO F data clear register bit definitions
//
//

struct GPFCLEAR_BITS       // bits   description
{
    UINT16 GPIOF0: 1;         // 0
    UINT16 GPIOF1: 1;         // 1
    UINT16 GPIOF2: 1;         // 2
    UINT16 GPIOF3: 1;         // 3
    UINT16 GPIOF4: 1;         // 4
    UINT16 GPIOF5: 1;         // 5
    UINT16 GPIOF6: 1;         // 6
    UINT16 GPIOF7: 1;         // 7
    UINT16 GPIOF8: 1;         // 8
    UINT16 GPIOF9: 1;         // 9
    UINT16 GPIOF10: 1;        // 10
    UINT16 GPIOF11: 1;        // 11
    UINT16 GPIOF12: 1;        // 12
    UINT16 GPIOF13: 1;        // 13
    UINT16 GPIOF14: 1;        // 14
    UINT16 GPIOF15: 1;        // 15

};

union GPFCLEAR_REG
{
    UINT16        all;
    struct GPFCLEAR_BITS bit;
};


//---------------------------------------------------
// GPIO F data toggle register bit definitions
//
//

struct GPFTOGGLE_BITS      // bits   description
{
    UINT16 GPIOF0: 1;         // 0
    UINT16 GPIOF1: 1;         // 1
    UINT16 GPIOF2: 1;         // 2
    UINT16 GPIOF3: 1;         // 3
    UINT16 GPIOF4: 1;         // 4
    UINT16 GPIOF5: 1;         // 5
    UINT16 GPIOF6: 1;         // 6
    UINT16 GPIOF7: 1;         // 7
    UINT16 GPIOF8: 1;         // 8
    UINT16 GPIOF9: 1;         // 9
    UINT16 GPIOF10: 1;        // 10
    UINT16 GPIOF11: 1;        // 11
    UINT16 GPIOF12: 1;        // 12
    UINT16 GPIOF13: 1;        // 13
    UINT16 GPIOF14: 1;        // 14
    UINT16 GPIOF15: 1;        // 15

};

union GPFTOGGLE_REG
{
    UINT16        all;
    struct GPFTOGGLE_BITS bit;
};

//----------------------------------------------
//  GPIO G mux control register bit definitions
//
//
struct GPGMUX_BITS         // bits   description
{
    UINT16 rsvd1: 4;          // 3:0
    UINT16 SCITXDB_GPIOG4: 1; // 4
    UINT16 SCIRXDB_GPIOG5: 1; // 5
    UINT16 rsvd2: 10;         // 15:6

};


/* Allow access to the bit fields or entire register */
union GPGMUX_REG
{
    UINT16        all;
    struct GPGMUX_BITS bit;
};

//---------------------------------------------------
// GPIO G Direction control register bit definitions
//
//

struct GPGDIR_BITS         // bits   description
{
    UINT16 rsvd1: 4;          // 3:0
    UINT16 GPIOG4: 1;         // 4
    UINT16 GPIOG5: 1;         // 5
    UINT16 rsvd2: 10;         // 15:6

};

union GPGDIR_REG
{
    UINT16        all;
    struct GPGDIR_BITS bit;
};

//---------------------------------------------------
// GPIO G data register bit definitions
//
//

struct GPGDAT_BITS         // bits   description
{
    UINT16 rsvd1: 4;          // 3:0
    UINT16 GPIOG4: 1;         // 4
    UINT16 GPIOG5: 1;         // 5
    UINT16 rsvd2: 10;         // 15:6

};

union GPGDAT_REG
{
    UINT16        all;
    struct GPGDAT_BITS bit;
};


//---------------------------------------------------
// GPIO G data set register bit definitions
//
//

struct GPGSET_BITS         // bits   description
{
    UINT16 rsvd1: 4;          // 3:0
    UINT16 GPIOG4: 1;         // 4
    UINT16 GPIOG5: 1;         // 5
    UINT16 rsvd2: 10;         // 15:6

};

union GPGSET_REG
{
    UINT16        all;
    struct GPGSET_BITS bit;
};


//---------------------------------------------------
// GPIO G data clear register bit definitions
//
//

struct GPGCLEAR_BITS       // bits   description
{
    UINT16 rsvd1: 4;          // 3:0
    UINT16 GPIOG4: 1;         // 4
    UINT16 GPIOG5: 1;         // 5
    UINT16 rsvd2: 10;         // 15:6

};

union GPGCLEAR_REG
{
    UINT16        all;
    struct GPGCLEAR_BITS bit;
};


//---------------------------------------------------
// GPIO G data toggle register bit definitions
//
//

struct GPGTOGGLE_BITS      // bits   description
{
    UINT16 rsvd1: 4;          // 3:0
    UINT16 GPIOG4: 1;         // 4
    UINT16 GPIOG5: 1;         // 5
    UINT16 rsvd2: 10;         // 15:6

};

union GPGTOGGLE_REG
{
    UINT16        all;
    struct GPGTOGGLE_BITS bit;
};


struct GPIO_MUX_REGS
{
    union  GPAMUX_REG   GPAMUX;
    union  GPADIR_REG   GPADIR;
    union  GPAQUAL_REG  GPAQUAL;
    UINT16   rsvd1;
    union  GPBMUX_REG   GPBMUX;
    union  GPBDIR_REG   GPBDIR;
    union  GPBQUAL_REG  GPBQUAL;
    UINT16   rsvd2[5];
    union  GPDMUX_REG   GPDMUX;
    union  GPDDIR_REG   GPDDIR;
    union  GPDQUAL_REG  GPDQUAL;
    UINT16   rsvd3;
    union  GPEMUX_REG   GPEMUX;
    union  GPEDIR_REG   GPEDIR;
    union  GPEQUAL_REG  GPEQUAL;
    UINT16   rsvd4;
    union  GPFMUX_REG   GPFMUX;
    union  GPFDIR_REG   GPFDIR;
    UINT16   rsvd5[2];
    union  GPGMUX_REG   GPGMUX;
    union  GPGDIR_REG   GPGDIR;
    UINT16   rsvd6[6];
};

struct GPIO_DATA_REGS
{
    union  GPADAT_REG    GPADAT;
    union  GPASET_REG    GPASET;
    union  GPACLEAR_REG  GPACLEAR;
    union  GPATOGGLE_REG GPATOGGLE;
    union  GPBDAT_REG    GPBDAT;
    union  GPBSET_REG    GPBSET;
    union  GPBCLEAR_REG  GPBCLEAR;
    union  GPBTOGGLE_REG GPBTOGGLE;
    UINT16   rsvd1[4];
    union  GPDDAT_REG    GPDDAT;
    union  GPDSET_REG    GPDSET;
    union  GPDCLEAR_REG  GPDCLEAR;
    union  GPDTOGGLE_REG GPDTOGGLE;
    union  GPEDAT_REG    GPEDAT;
    union  GPESET_REG    GPESET;
    union  GPECLEAR_REG  GPECLEAR;
    union  GPETOGGLE_REG GPETOGGLE;
    union  GPFDAT_REG    GPFDAT;
    union  GPFSET_REG    GPFSET;
    union  GPFCLEAR_REG  GPFCLEAR;
    union  GPFTOGGLE_REG GPFTOGGLE;
    union  GPGDAT_REG    GPGDAT;
    union  GPGSET_REG    GPGSET;
    union  GPGCLEAR_REG  GPGCLEAR;
    union  GPGTOGGLE_REG GPGTOGGLE;
    UINT16   rsvd2[4];
};


//---------------------------------------------------------------------------
// GPI/O External References & Function Declarations:
//
extern volatile struct GPIO_MUX_REGS GpioMuxRegs;
extern volatile struct GPIO_DATA_REGS GpioDataRegs;


#endif  // end of DSP28_GPIO_H definition

//===========================================================================
// No more.
//===========================================================================
